git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-03 Tue 23:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Git</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Git</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Installation</a></li>
<li><a href="#orgheadline6">3. Usage</a>
<ul>
<li><a href="#orgheadline3">3.1. Configuration</a></li>
<li><a href="#orgheadline4">3.2. Create repository</a></li>
<li><a href="#orgheadline5">3.3. Basic snapshotting</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Git</i> is a famous and powerful open-source software for version control and management. It was developed by Linus Torvalds with C programing language. What is different from <i>subversion</i>, git adopts a completely distributed manner. Regarding its utilization, besides its built-in manual, there is also an excellent book, <i>Pro Git</i>, which can be obtained for free<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. This short blog just summarizes the preliminary usage of git, which is referred from the book.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
On Unix/Linux operation systems, git can be easily installed. Taking <i>ArchLinux</i> for instance, git can be installed via following command.
</p>
<div class="org-src-container">

<pre class="src src-sh">pacman -S git
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Configuration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Command <code>git config</code> can define the default preference or behavior of git. There are several files this command will read from and write to so we can set values globally or down to specific repositories.
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> Create repository</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Git repository can be created either from a local directory by running <code>git init</code> in it or clone from a remote repository by <code>git clone url</code>.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Basic snapshotting</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>git add</code> adds content from the working directory into the staging area (or ``index'') for the next commit.</li>
<li><code>git status</code> shows the different states of files in the working directory and staging area. Which files are modified and unstaged and which are staged but not yet committed.</li>
<li><code>git diff</code> shows the differences between any two trees.
<ul class="org-ul">
<li><code>git diff</code> shows the difference between the working environment and the staging area.</li>
<li><code>git diff --staged</code> shows the difference between the staging area and the last commit.</li>
<li><code>git diff branchA branchB</code> shows the difference between two commits.</li>
</ul></li>
<li><code>git commit</code> takes all the file contents that have been staged with git add and records a new permanent snapshot in the database and then moves the branch pointer on the current branch up to it.</li>
<li><code>git reset</code> resets current <code>HEAD</code> to the specified state. It moves around the <code>HEAD</code> pointer and optionally changes the index or staging area.
<ul class="org-ul">
<li><code>git reset --hard</code> resets the working directory.</li>
</ul></li>
<li><code>git rm</code> remove files from the staging area and working directory.</li>
<li><code>git mv</code> moves/renames a file and then run <code>git add</code> on the new file and <code>git rm</code> on the old file.</li>
<li><code>git clean</code> removes unwanted files from working directory.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://git-scm.com/book/en/v2">http://git-scm.com/book/en/v2</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: shaka</p>
<p class="date">Created: 2015-11-03 Tue 23:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
